package day5.aExercise;

public class Other {
    public static void main(String[] args) {
        // 1、【选做】【难】设计一个方法，计算一个正整数的二进制原码
        // 2、【选做】【难】从控制台输入一个数字，判断一个数字是不是回文数
        //    12345         =>       54321
        //    原                     翻转
        //    1234                  5
        //    123                   54
        //    12                    543
        //    1                     5432
        //    0                     54321
        // 3、【选做】【难】求2+22+222+2222+22222+...+2...2的和，数字的数量由控制台输入
    }
}
